import React from 'react';
import styles from "../textPage.module.scss";
import sidebarRightPolitic from '../../media/sidebar_right/sidebarRight_politic.png';
import ScrollbarBlock from '../../helpers/scrollbarBlock/ScrollbarBlock';
import {TitleComponent} from "../../helpers/title/TitleComponent";
import RightSidebarTextPage from "../../helpers/RightSidebarTextPage/RightSidebarTextPage";

const Content = () => {
	return (<>
		<p>1. Общие положения Настоящая политика обработки персональных данных составлена в соответствии с
			требованиями Федерального закона от 27.07.2006. №152-ФЗ «О персональных данных» и определяет
			порядок
			обработки персональных данных и меры по обеспечению безопасности персональных данных Торговый
			советник (далее – Оператор).</p>
		<p>Оператор ставит своей важнейшей целью и условием осуществления своей деятельности соблюдение прав
			и
			свобод человека и гражданина при обработке его персональных данных, в том числе защиты прав на
			неприкосновенность частной жизни, личную и семейную тайну. Настоящая политика Оператора в
			отношении
			обработки персональных данных (далее – Политика) применяется ко всей информации, которую
			Оператор
			может получить о посетителях веб-сайта http://адвисер.рф.</p>
		<p>2. Основные понятия, используемые в Политике Автоматизированная обработка персональных данных –
			обработка персональных данных с помощью средств вычислительной техники; Блокирование
			персональных
			данных – временное прекращение обработки персональных данных (за исключением случаев, если
			обработка
			необходима для уточнения персональных данных); Веб-сайт – совокупность графических и
			информационных
			материалов, а также программ для ЭВМ и баз данных, обеспечивающих их доступность в сети интернет
			по
			сетевому адресу http://адвисер.рф; Информационная система персональных данных — совокупность
			содержащихся в базах данных персональных данных, и обеспечивающих их обработку информационных
			технологий и технических средств; Обезличивание персональных данных — действия, в результате
			которых
			невозможно определить без использования дополнительной информации принадлежность персональных
			данных
			конкретному Пользователю или иному субъекту персональных данных; Обработка персональных данных –
			любое действие (операция) или совокупность действий (операций), совершаемых с использованием
			средств
			автоматизации или без использования таких средств с персональными данными, включая сбор, запись,
			систематизацию, накопление, хранение, уточнение (обновление, изменение), извлечение,
			использование,
			передачу (распространение, предоставление, доступ), обезличивание, блокирование, удаление,
			уничтожение персональных данных;</p>
		<p>2. Основные понятия, используемые в Политике Автоматизированная обработка персональных данных –
			обработка персональных данных с помощью средств вычислительной техники; Блокирование
			персональных
			данных – временное прекращение обработки персональных данных (за исключением случаев, если
			обработка
			необходима для уточнения персональных данных); Веб-сайт – совокупность графических и
			информационных
			материалов, а также программ для ЭВМ и баз данных, обеспечивающих их доступность в сети интернет
			по
			сетевому адресу http://адвисер.рф; Информационная система персональных данных — совокупность
			содержащихся в базах данных персональных данных, и обеспечивающих их обработку информационных
			технологий и технических средств; Обезличивание персональных данных — действия, в результате
			которых
			невозможно определить без использования дополнительной информации принадлежность персональных
			данных
			конкретному Пользователю или иному субъекту персональных данных; Обработка персональных данных –
			любое действие (операция) или совокупность действий (операций), совершаемых с использованием
			средств
			автоматизации или без использования таких средств с персональными данными, включая сбор, запись,
			систематизацию, накопление, хранение, уточнение (обновление, изменение), извлечение,
			использование,
			передачу (распространение, предоставление, доступ), обезличивание, блокирование, удаление,
			уничтожение персональных данных;</p>
		<p>2. Основные понятия, используемые в Политике Автоматизированная обработка персональных данных –
			обработка персональных данных с помощью средств вычислительной техники; Блокирование
			персональных
			данных – временное прекращение обработки персональных данных (за исключением случаев, если
			обработка
			необходима для уточнения персональных данных); Веб-сайт – совокупность графических и
			информационных
			материалов, а также программ для ЭВМ и баз данных, обеспечивающих их доступность в сети интернет
			по
			сетевому адресу http://адвисер.рф; Информационная система персональных данных — совокупность
			содержащихся в базах данных персональных данных, и обеспечивающих их обработку информационных
			технологий и технических средств; Обезличивание персональных данных — действия, в результате
			которых
			невозможно определить без использования дополнительной информации принадлежность персональных
			данных
			конкретному Пользователю или иному субъекту персональных данных; Обработка персональных данных –
			любое действие (операция) или совокупность действий (операций), совершаемых с использованием
			средств
			автоматизации или без использования таких средств с персональными данными, включая сбор, запись,
			систематизацию, накопление, хранение, уточнение (обновление, изменение), извлечение,
			использование,
			передачу (распространение, предоставление, доступ), обезличивание, блокирование, удаление,
			уничтожение персональных данных;</p>
	</>)
}

export default function Politic() {
	return (<>
		<TitleComponent title="Политика конфиденциальности" />
		<div className={styles.container}>
			<div className={styles.content}>
				<h1 className='h1'>Политика <br/>конфиденциальности</h1>
				<p className='h2 subHeader'>Политика в отношении обработки персональных данных</p>
				<div className={styles.mediaBlock}>
					<ScrollbarBlock content={Content()}/>
				</div>
			</div>
			<RightSidebarTextPage imgsrc={sidebarRightPolitic}/>
		</div>
	</>);
}